## Step 1: Connect to the database and read the values

In [356]:
import pandas as pd
from sqlalchemy import create_engine

engine = create_engine('postgresql://postgres@localhost/shuttle_database')

conn = engine.connect()
input_df = pd.read_sql("SELECT * FROM shuttle_locations LIMIT 1000000", conn)
input_df

,shuttle_id,tech_provider_id,shuttle_company_id,local_timestamp,location,cnn
0,252,2,2,2017-09-19 22:46:22,"(-122.3967933,37.7457141)",5988000.0
1,125,2,2,2017-09-19 22:46:22,"(-122.3963909,37.745213)",NaN
2,115,2,1,2017-09-19 22:52:47,"(-122.3930867,37.7555999)",10336000.0
3,313,2,1,2017-09-19 22:52:47,"(-122.3935873,37.7558359)",NaN
4,242,2,2,2017-09-19 22:58:07,"(-122.396788,37.7456755)",NaN
5,100,2,2,2017-09-19 22:58:06,"(-122.3963553,37.745296)",NaN
6,319,2,2,2017-09-19 22:58:05,"(-122.3966214,37.7456051)",5988000.0
7,21,2,1,2017-09-19 22:58:11,"(-122.3849934,37.7544446)",NaN
8,113,4,5,2017-09-19 17:53:16,"(-122.423787,37.788707)",5823000.0
9,97,2,2,2017-09-19 23:02:52,"(-122.396892,37.745798)",5988000.0
10,137,2,1,2017-09-19 23:09:20,"(-122.3935328,37.7558981)",NaN
11,15,2,1,2017-09-19 23:14:46,"(-122.3850824,37.7544083)",NaN
12,21,2,1,2017-09-19 23:14:44,"(-122.3849966,37.754441)",NaN
13,239,2,1,2017-09-19 23:14:47,"(-122.3849436,37.7544109)",NaN
14,139,2,2,2017-09-19 23:14:47,"(-122.3963814,37.745312)",NaN
15,242,2,2,2017-09-19 23:14:52,"(-122.3967643,37.7456745)",NaN
16,8,2,2,2017-09-19 23:14:53,"(-122.3961904,37.7452377)",NaN
17,43,2,9,2017-09-19 23:14:01,"(-122.40512,37.7667579)",NaN
18,24,2,1,2017-09-19 23:14:55,"(-122.3931393,37.7558169)",NaN
19,315,2,1,2017-09-19 23:15:00,"(-122.3843992,37.7544659)",NaN
20,125,2,2,2017-09-19 23:15:00,"(-122.396443,37.7453755)",NaN
21,97,2,2,2017-09-19 23:14:58,"(-122.3969125,37.7457938)",5988000.0
22,208,2,1,2017-09-19 23:14:57,"(-122.3931822,37.7559333)",NaN
23,208,2,1,2017-09-19 23:19:41,"(-122.3931781,37.7559297)",NaN
24,63,2,1,2017-09-19 23:23:10,"(-122.3931694,37.7559681)",NaN
25,24,2,1,2017-09-19 23:23:10,"(-122.393143,37.755816)",NaN
26,279,2,2,2017-09-19 23:23:15,"(-122.396482,37.7455075)",NaN
27,115,2,1,2017-09-19 23:27:31,"(-122.3931542,37.7555412)",NaN
28,125,2,2,2017-09-19 23:27:38,"(-122.3964906,37.7452867)",NaN
29,208,2,1,2017-09-19 23:27:39,"(-122.393178,37.7559269)",NaN
...,...,...,...,...,...,...
999970,156,2,6,2017-09-19 05:52:11,"(-122.4049903,37.7641122)",NaN
999971,84,2,4,2017-09-19 05:52:12,"(-122.39530901436,37.7879103552902)",108001.0
999972,162,2,1,2017-09-19 05:52:17,"(-122.4283804,37.7516898)",1359000.0
999973,292,2,1,2017-09-19 05:52:21,"(-122.3846447,37.7543723)",1319000.0
999974,37,2,1,2017-09-19 05:52:22,"(-122.3931372,37.7557779)",NaN
999975,93,2,4,2017-09-19 06:09:02,"(-122.406125106031,37.7616383275369)",NaN
999976,314,2,1,2017-09-19 06:09:10,"(-122.3925184,37.7567894)",NaN
999977,7,2,4,2017-09-19 05:52:34,"(-122.4052222,37.7658224)",NaN
999978,7,2,4,2017-09-19 05:52:37,"(-122.4051663,37.7652568)",NaN
999979,23,1,7,2017-09-19 05:54:18,"(-122.4252928,37.8012672)",8453101.0
999980,149,2,4,2017-09-19 05:52:39,"(-122.444932814802,37.7731412323544)",5455000.0
999981,14,1,1,2017-09-19 05:54:22,"(-122.395072,37.7820032)",3281000.0
999982,64,2,2,2017-09-19 05:52:40,"(-122.3970322,37.7457453)",NaN
999983,111,2,2,2017-09-19 05:52:45,"(-122.4193439,37.7702447)",NaN
999984,179,2,6,2017-09-19 05:52:47,"(-122.446323,37.7691481)",13374000.0
999985,276,1,4,2017-09-19 06:11:10,"(-122.4159488,37.7772928)",446000.0
999986,363,1,4,2017-09-19 06:11:12,"(-122.3995264,37.7923424)",10454000.0
999987,226,2,2,2017-09-19 06:09:36,"(-122.3967555,37.7456229)",NaN
999988,349,1,7,2017-09-19 06:11:15,"(-122.4723968,37.7169152)",931000.0
999989,179,2,6,2017-09-19 06:09:40,"(-122.4088255,37.773484)",6732000.0
999990,314,2,1,2017-09-19 06:09:40,"(-122.3921143,37.7504654)",NaN
999991,362,2,6,2017-09-19 06:09:40,"(-122.4037952,37.7982604)",NaN
999992,320,2,1,2017-09-19 06:09:43,"(-122.4096561,37.7695102)",NaN
999993,131,2,4,2017-09-19 06:09:42,"(-122.4093689412,37.7551506440902)",3312000.0
999994,93,2,4,2017-09-19 06:09:43,"(-122.402989938969,37.7530879900211)",NaN
999995,257,2,10,2017-09-19 06:09:43,"(-122.474942542727,37.7244011359641)",928102.0
999996,299,2,6,2017-09-19 06:09:43,"(-122.36554898333,37.8097423212955)",NaN
999997,149,2,4,2017-09-19 05:52:57,"(-122.446413729454,37.7729674335921)",5456000.0
999998,64,2,2,2017-09-19 05:53:02,"(-122.3970325,37.7457456)",NaN
999999,162,2,1,2017-09-19 05:53:44,"(-122.4265719,37.7518398)",1358000.0

## Step 2: fill in the blanks on data that does not have CNN information

In [357]:
import math
import functools
import datetime as dt

def start_time(series):
    return functools.reduce(lambda x, y: x if x < y else y, series)
 
def start_time(series):
    return functools.reduce(lambda x, y: x if x < y else y, series)
        
def new_cnn(series):
    if len(series)<2:
        return True
    else:
        return series[0] != series[1]
    
def flatten_aggregations(df):
    df.columns = [' '.join(col).strip() for col in df.columns.values]
    return df

def create_cnn_events(df):
    return df['cnn'].rolling(2, min_periods=1).apply(new_cnn).cumsum()

def prep_df_for_summary(df):
    def to_summary_format(df):
       return pd.concat([
            df['shuttle_id first'],
            df['cnn first'],
            df['ts min'],
            df['ts max'],
            df['ts count']] ,
            axis=1, 
            keys=['shuttle_id','cnn','start_time', 'end_time','num_points']) 

    dfs = df.groupby(['shuttle_id'])
    shuttle_map = {}
    for name, grouped in dfs:
        sorted_df = grouped.sort_values('local_timestamp')
        sorted_df['cnn'].fillna(method='ffill',inplace=True)
        sorted_df['cnn_event'] = create_cnn_events(sorted_df)
        sorted_df['ts'] = sorted_df['local_timestamp'].astype('int64')

        cnn_grouped_df = sorted_df.groupby(['cnn_event'])
        cnn_aggregated_df = cnn_grouped_df.agg({'shuttle_id': 'first', 'cnn': 'first', 'ts': ['min','max','count']})
        
        cnn_aggregated_df = flatten_aggregations(cnn_aggregated_df)        

        df = cnn_aggregated_df
        summary_facts_df = pd.concat([
            df['shuttle_id first'],
            df['cnn first'],
            df['ts min'],
            df['ts max'],
            df['ts count']] ,
            axis=1, 
            keys=['shuttle_id','cnn','start_time', 'end_time','num_points'])

        summary_facts_df['start_time'] = pandas.to_datetime(summary_facts_df['start_time'], unit='ns')
        summary_facts_df['end_time'] = pandas.to_datetime(summary_facts_df['end_time'], unit='ns')
        shuttle_map[name] = summary_facts_df

    return shuttle_map
result = prep_df_for_summary(input_df)

## Step 4: Insert into shuttle_summary_facts Table

In [358]:
for a in result.values():
    a.to_sql(name='shuttle_summary_facts', index=False, if_exists='append', chunksize=10000, con=conn)